#ifndef UNTITLED6_POLAR_H
#define UNTITLED6_POLAR_H

//------------------------------------------------------------------------------
// polar.h - содержит описание полярного числа и его интерфейса
//------------------------------------------------------------------------------

#include "rnd.h"
#include <iostream>
#include <fstream>

using namespace std;

class polar {
public:
    double angle, radius;
};

//------------------------------------------------------------------------------
// Вычисление значения комплексного числа.
double polar_calculation (polar &p);

// Случайный ввод параметров комплексного числа
void polar_InRnd(polar &p);

//------------------------------------------------------------------------------
// Вывод параметров полярного числа в форматируемый поток
void polar_Out(polar &p, ofstream &ofst);

//------------------------------------------------------------------------------
// Ввод параметров поляпного числа из файла
void polar_In(polar &p, ifstream &ifst);

#endif //UNTITLED6_POLAR_H
