//------------------------------------------------------------------------------
// polar.c - содержит процедуру ввода параметров
// для уже созданного полярного числа.
//------------------------------------------------------------------------------

#include "polar.h"
//------------------------------------------------------------------------------
// Вычисление значения комплексного числа.
double polar::polar_calculation(polar &p) {
    return p.radius;
}

// Случайный ввод параметров комплексного числа
void polar::polar_InRnd(polar &p) {
    p.radius = Random();
    p.angle = Random();
}
//------------------------------------------------------------------------------
// Вывод параметров полярного числа в форматируемый поток
void polar::polar_Out(polar &p, ofstream &ofst) {
    ofst << "It is polar number: radius = " << p.radius << ", angle = " << p.angle
         << ". Perimeter = " << polar::polar_calculation(p) << "\n";
}
//------------------------------------------------------------------------------
// Ввод параметров поляпного числа из файла
void polar::polar_In(polar &p, ifstream &ifst) {
    ifst >> p.radius >> p.angle;
}
